Revit 2027 API
StructuralSectionGeneralCEx Constructor
 Creates a new instance of general Channel Cold Formed shape.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSectionGeneralCEx(
	double width,
	double height,
	double wallNominalThickness,
	double wallDesignThickness,
	double innerFillet,
	double lipLength,
	double foldLength,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams analysisParams
)
Public Sub New (
	width As Double,
	height As Double,
	wallNominalThickness As Double,
	wallDesignThickness As Double,
	innerFillet As Double,
	lipLength As Double,
	foldLength As Double,
	centroidHorizontal As Double,
	centroidVertical As Double,
	analysisParams As StructuralSectionAnalysisParams
)
public:
StructuralSectionGeneralCEx(
	double width,
	double height,
	double wallNominalThickness,
	double wallDesignThickness,
	double innerFillet,
	double lipLength,
	double foldLength,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams^ analysisParams
)
new :
        width : float *
        height : float *
        wallNominalThickness : float *
        wallDesignThickness : float *
        innerFillet : float *
        lipLength : float *
        foldLength : float *
        centroidHorizontal : float *
        centroidVertical : float *
        analysisParams : StructuralSectionAnalysisParams -> StructuralSectionGeneralCEx
Parameters
width Double
 Section width.
height Double
 Section height, depth.
wallNominalThickness Double
 Represents wall nominal thickness of rectangle.
wallDesignThickness Double
 Represents wall design thickness of rectangle.
innerFillet Double
 Inner Fillet - Corner fillet inner radius.
lipLength Double
 Lip segment length.
foldLength Double
 Fold segment length.
centroidHorizontal Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical Double
 Distance from centroid to the upper extremites along vertical axis.
analysisParams StructuralSectionAnalysisParams
 Common set of parameters for structural analysis.
See Also
Reference
StructuralSectionGeneralCEx Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace